<?php

namespace Database\Seeders;

use App\Models\Job;
use Illuminate\Database\Seeder;

class JobSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    $jobs = array(
      array('id' => '1', 'title' => 'Научный аналитик', 'created_at' => '2024-02-06 00:14:26', 'updated_at' => '2024-02-06 00:14:26'),
      array('id' => '2', 'title' => 'Менеджер по развитию бизнеса', 'created_at' => '2024-02-06 00:14:44', 'updated_at' => '2024-02-06 00:14:44'),
      array('id' => '3', 'title' => 'Руководитель Департамента аналитики и статистики', 'created_at' => '2024-02-06 00:17:16', 'updated_at' => '2024-02-06 00:17:16'),
      array('id' => '4', 'title' => 'Руководитель Департамента управления человеческими  ресурсами', 'created_at' => '2024-02-06 00:17:32', 'updated_at' => '2024-02-06 00:17:32'),
      array('id' => '5', 'title' => 'Руководитель отдела расходами Эволет Таджикистан', 'created_at' => '2024-02-06 00:17:49', 'updated_at' => '2024-02-06 00:17:49'),
      array('id' => '6', 'title' => 'Руководитель отдела анализа производителей', 'created_at' => '2024-02-06 00:18:15', 'updated_at' => '2024-02-06 00:18:15'),
      array('id' => '7', 'title' => 'Руководитель отдела планирование производство и логистики', 'created_at' => '2024-02-06 00:18:46', 'updated_at' => '2024-02-06 00:18:46'),
      array('id' => '8', 'title' => 'Руководитель отдела дизайна', 'created_at' => '2024-02-06 00:18:55', 'updated_at' => '2024-02-06 00:18:55'),
      array('id' => '9', 'title' => 'Руководитель отдела товарных знаков', 'created_at' => '2024-02-06 00:19:07', 'updated_at' => '2024-02-06 00:19:07'),
      array('id' => '10', 'title' => 'Руководитель отдела веб разработок', 'created_at' => '2024-02-06 00:19:20', 'updated_at' => '2024-02-06 00:19:20'),
      array('id' => '11', 'title' => 'Руководитель отдела автоматизации рабочих процессов', 'created_at' => '2024-02-06 00:19:34', 'updated_at' => '2024-02-06 00:19:34'),
      array('id' => '12', 'title' => 'Руководитель отдела регистрации', 'created_at' => '2024-02-06 00:19:53', 'updated_at' => '2024-02-06 00:19:53'),
      array('id' => '13', 'title' => 'Руководитель отдела составления досье', 'created_at' => '2024-02-06 00:20:08', 'updated_at' => '2024-02-06 00:20:08'),
      array('id' => '14', 'title' => 'Руководитель Отдела мониторинга и финансового контроля Эволет Европы', 'created_at' => '2024-02-06 00:20:29', 'updated_at' => '2024-02-06 00:20:29'),
      array('id' => '15', 'title' => 'Руководитель отдела платежной реконсиляции', 'created_at' => '2024-02-06 00:20:45', 'updated_at' => '2024-02-06 00:20:45'),
      array('id' => '16', 'title' => 'Руководитель Отдела Цифрового Маркетинга', 'created_at' => '2024-02-06 00:21:11', 'updated_at' => '2024-02-06 00:21:11'),
      array('id' => '17', 'title' => 'Руководитель-менеджер по развитию бизнеса', 'created_at' => '2024-02-06 00:21:23', 'updated_at' => '2024-02-06 00:21:23'),
      array('id' => '18', 'title' => 'КПГ', 'created_at' => '2024-02-06 00:21:44', 'updated_at' => '2024-02-06 00:21:44'),
      array('id' => '19', 'title' => 'Ведущий специалист по регистрации товарных знаков', 'created_at' => '2024-02-06 00:21:55', 'updated_at' => '2024-02-06 00:21:55'),
      array('id' => '20', 'title' => 'Тех аналитик-дизайнер', 'created_at' => '2024-02-06 00:22:05', 'updated_at' => '2024-02-06 00:22:05'),
      array('id' => '21', 'title' => 'Переводчик', 'created_at' => '2024-02-06 00:22:17', 'updated_at' => '2024-02-06 00:22:17'),
      array('id' => '22', 'title' => 'Графический дизайнер', 'created_at' => '2024-02-06 00:22:26', 'updated_at' => '2024-02-06 00:22:26'),
      array('id' => '23', 'title' => 'Научный редактор', 'created_at' => '2024-02-06 00:22:40', 'updated_at' => '2024-02-06 00:22:40'),
      array('id' => '24', 'title' => 'Дизайнер - научный редактор', 'created_at' => '2024-02-06 00:22:55', 'updated_at' => '2024-02-06 00:22:55'),
      array('id' => '25', 'title' => 'Аналитик', 'created_at' => '2024-02-06 00:23:10', 'updated_at' => '2024-02-06 00:23:10'),
      array('id' => '26', 'title' => 'Уборщица', 'created_at' => '2024-02-06 00:23:33', 'updated_at' => '2024-02-06 00:23:33'),
      array('id' => '27', 'title' => 'Ведущий специалист отдела HR', 'created_at' => '2024-02-06 00:24:21', 'updated_at' => '2024-02-06 00:24:21'),
      array('id' => '28', 'title' => 'Специалист по составлению регистрационного досье', 'created_at' => '2024-02-06 00:24:32', 'updated_at' => '2024-02-06 00:24:32'),
      array('id' => '29', 'title' => 'Регистратор Досье', 'created_at' => '2024-02-06 00:24:45', 'updated_at' => '2024-02-06 00:24:45'),
      array('id' => '30', 'title' => 'Веб-мастер', 'created_at' => '2024-02-06 00:24:56', 'updated_at' => '2024-02-06 00:24:56'),
      array('id' => '31', 'title' => 'Копирайтер', 'created_at' => '2024-02-06 00:25:27', 'updated_at' => '2024-02-06 00:25:27'),
      array('id' => '32', 'title' => 'СММ специалист', 'created_at' => '2024-02-06 00:25:39', 'updated_at' => '2024-02-06 00:25:39'),
      array('id' => '33', 'title' => 'Проектный менеджер', 'created_at' => '2024-02-06 00:26:25', 'updated_at' => '2024-02-06 00:26:25'),
      array('id' => '34', 'title' => 'Администратор', 'created_at' => '2024-02-06 00:26:53', 'updated_at' => '2024-02-06 00:26:53'),
      array('id' => '35', 'title' => 'Видеомейкер', 'created_at' => '2024-02-06 00:27:05', 'updated_at' => '2024-02-06 00:27:05'),
      array('id' => '36', 'title' => 'Младший специалист отдела финансов', 'created_at' => '2024-02-06 00:28:31', 'updated_at' => '2024-02-06 00:28:31'),
      array('id' => '38', 'title' => 'Стажер', 'created_at' => '2024-02-06 17:09:19', 'updated_at' => '2024-02-06 17:09:19'),
      array('id' => '39', 'title' => 'Специалист', 'created_at' => '2024-02-11 22:46:05', 'updated_at' => '2024-02-11 22:46:05'),
      array('id' => '40', 'title' => 'Младший специалист', 'created_at' => '2024-02-11 23:14:46', 'updated_at' => '2024-02-11 23:14:46')
    );

    foreach ($jobs as $job) {
      Job::create([
        'id' => $job['id'],
        'title' => $job['title'],
        'created_at' => $job['created_at'],
        'updated_at' => $job['updated_at'],
      ]);
    }
  }
}
